Revit 2027 API
RebarShapeDefinition.GetParameterDefaultValue Method
 Return the parameter's default value as stored in the definition.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetParameterDefaultValue(
	ElementId paramId
)
Public Function GetParameterDefaultValue (
	paramId As ElementId
) As Double
public:
double GetParameterDefaultValue(
	ElementId^ paramId
)
member GetParameterDefaultValue :
        paramId : ElementId -> float
Parameters
paramId ElementId
 Id of a parameter in the definition.
Return Value
Double
 The parameter value.
Exceptions
Exception | Condition
ArgumentException |  This RebarShapeDefinition does not have a value for the parameter paramId.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarShapeDefinition Class
Autodesk.Revit.DB.Structure Namespace